Repository: datosgobes/ckanext-dge
Catalog: ckanext/dge/i18n/*/LC_MESSAGES/ckanext-dge.po
Languages: gl

source: accessible_apidata_content
gl: <p>O API é un mecanismo que permite consultar a base de datos semántica de datos.gob.es. Proporciona acceso á información do Catálogo de datos e as URIs definidas nos anexos IV e V de la Norma Técnica de Interoperabilidade de Reutilización de recursos da información.</p><p>Estas consultas realízanse baseándose nuns criterios que pode elixir o usuario e utilizando identificadores uniformes de recursos (URI).</p><h2>Formatos de resposta</h2><p>A información dispoñible a través do API pódese obter en diferentes formatos. Os formatos dispoñibles son: json, xml, rdf, ttl e csv.</p><p>JSON é o formato da resposta por defecto; por exemplo: se se accede ao seguinte recurso de API a través do navegador <small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset</code></small>, verase o resultado en formato JSON.</p><p>Hai dúas opcións para indicar o formato de resposta que se desexa:</p><div class="alert alert-info"><ol><li>Mediante o parámetro <small class="text-error"><code><strong>'Accept'</strong></code></small> nas cabeceiras da petición. Por exemplo: <small class="text-error"><code>Accept:application/rdf+xml</code></small></li><li>Indicando o formato mediante a súa extensión na petición. Por exemplo: <small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset.xml</code></small></li></ol></div><div class="table-responsive"><table class="table table-condensed table-bordered"><thead><tr><th>Formato</th><th>1. Header 'Accept'</th><th>2. Extensión de formato</th></tr></thead><tbody><tr><td>JSON</td><td>application/json</td><td>.json</td></tr><tr><td>XML</td><td>application/xml</td><td>.xml</td></tr><tr><td>RDF</td><td>application/rdf+xml</td><td>.rdf</td></tr><tr><td>Turtle</td><td>application/x-turtle</td><td>.turtle</td></tr><tr><td>CSV</td><td>text/csv</td><td>.csv</td></tr></tbody></table></div><h2>Parámetros API</h2><p>A API ofrece unha serie de parámetros que permiten personalizar as respostas:</p><div class="table-responsive"><table class="table table-condensed table-bordered"><thead><tr><th>Parámetro</th><th>Descrición</th><th>Exemplos</th></tr></thead><tbody><tr><td><small class="text-error"><code><strong>_sort</strong></code></small></td><td>Con este parámetro pódense ordenar os resultados en función de un ou varios campos da resposta.<br><br>Débese indicar o nome do campo polo que se desexan ordenar os resultados.<br><br>Para inverter a orde hai que engadir o símbolo menos '-' diante do nome do campo.<br><br>Pódense combinar varios campos usando a coma ',' como separador entre eles.</td><td>Por exemplo, se queremos obter todos os datasets ordenados por data descendente e título:<br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset.json?_sort=-issued,title</code></small></td></tr><tr><td><small class="text-error"><code><strong>_pageSize</strong></code></small></td><td>Este parámetro utilízase para fixar o número de resultados por páxina.<br><br>O valor máximo é 50.</td><td>Por exemplo, para obter os resultados un por un:<br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset.xml?_pageSize=1</code></small></td></tr><tr><td><small class="text-error"><code><strong>_page</strong></code></small></td><td>Este parámetro utilízase para indicar o número de páxina no que nos encontramos.<br><br>A páxina inicial é 0.</td><td>Por exemplo, para estar na terceira páxina dos resultados: <br><br><small class="text-error "><code>http://datos.gob.es/apidata/catalog/dataset.xml?_pageSize=1&_page=2</code></small></td></tr></tbody></table></div><h2>Chamadas dispoñibles</h2><h3>Catálogo de datos</h3><p>Conxunto de chamadas que permiten consultar o Catálogo de datos de datos.gob.es.</p><div class="table-responsive"><table class="table table-condensed table-bordered"><caption><strong>Conxuntos de datos</strong></caption><thead><tr><th>Operación</th><th>Descrición</th><th>Exemplos</th></tr></thead><tbody><tr><td><strong>Obter todos os conxuntos de datos</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/dataset</strong></code></small></td><td></td></tr><tr><td><strong>Obter un conxunto de datos polo seu identificador URI</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/dataset/{id}</strong></code></small><br><br>Débese especificar o valor de <small class="text-error"><code><strong>{id}</strong></code></small>.</td><td>Por exemplo, se o <small><code>{id}</code></small> ten o valor: <small><code>'a16003011-empresas-y-personas-empleadas-en-la-c-a-de-euskadi-supervivientes-en-2015-altas-en-los-cinco-anos-anteriores-por-territorio-y-comarca-de-sede-social'</code></small>, a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset/a16003011-empresas-y-personas-empleadas-en-la-c-a-de-euskadi-supervivientes-en-2015-altas-en-los-cinco-anos-anteriores-por-territorio-y-comarca-de-sede-social</code></small></td></tr><tr><td><strong>Obter conxuntos de datos cun determinado título</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/dataset/title/{title}</strong></code></small><br><br>Débese especificar o valor de <small class="text-error"><code><strong>{title}</strong></code></small>. Pode ser parte do título.</td><td>Por exemplo, se <small><code>{title}</code></small> ten o valor: <small><code>'emprego'</code></small>, a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset/title/emprego</code></small></td></tr><tr><td><strong>Obter os conxuntox de datos dun determinado publicador a través do seu identificador</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/dataset/publisher/{id}</strong></code></small><br><br>Débese especificar o valor de <small class="text-error"><code><strong>{id}</strong></code></small>.</td><td>Por exemplo, se <small><code>{id}</code></small> ten o valor: <small><code>'A16003011'</code></small>, a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset/publisher/A16003011</code></small></td></tr><tr><td><strong>Obter os conxuntos de datos dunha determinada categoría ou temática a través do seu identificador</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/dataset/theme/{id}</strong></code></small><br><br>Débese especificar o valor de <small class="text-error"><code><strong>{id}</strong></code></small>.</td><td>Por exemplo, se <small><code>{id}</code></small> ten o valor: <small><code>'hacienda'</code></small>, a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset/theme/hacienda</code></small></td></tr><tr><td><strong>Obter os conxuntos de datos que ten distribucións nun determinado formato</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/dataset/format/{format}</strong></code></small></td><td>Por exemplo, se <small><code>{format}</code></small> ten o valor: <small><code>'csv'</code></small>, a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset/format/csv</code></small></td></tr><tr><td><strong>Obter os conxuntos de datos que conteñen unha determinada etiqueta</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/dataset/keyword/{keyword}</strong></code></small></td><td>Se <small><code>{keyword}</code></small> ten o valor: <small><code>'gastos'</code></small>, a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset/keyword/gastos</code></small></td></tr><tr><td><strong>Obter os conxuntos de datos que pertencen a un determinado ámbito xeográfico</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/dataset/spatial/{spatialWord1}/{spatialWord2}</strong></code></small><br><br>Nesta chamada utilízanse dous parámetros: <small class="text-error"><code><strong>{spatialWord1}</strong></code></small> e <small class="text-error"><code><strong>{spatialWord2}</strong></code></small>.</td><td>Se <small><code>{spatialWord1}</code></small> ten o valor: <small><code>'Autonomia'</code></small> e <small><code>{spatialWord2}</code></small> ten o valor: <small><code>'Pais-Vasco'</code></small> a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset/spatial/Autonomia/Pais-Vasco</code></small></td></tr><tr><td><strong>Obter os conxuntos de datos que foron actualizados entre dúas datas</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/dataset/modified/begin/{beginDate}/end/{endDate}</strong></code></small><br><br>Nesta chamada utilízanse dous parámetros: <small class="text-error"><code><strong>{beginDate}</strong></code></small> e <small class="text-error"><code><strong>{endDate}</strong></code></small>, cuxo formato debe ser <small class="text-error"><code><strong>AAAA-MM-DDTHH:mmZ</strong></code></small>.</td><td>Se <small><code>{beginDate}</code></small> ten o valor: <small><code>2016-04-18T00:00Z</code></small> e <small><code>{endDate}</code></small> ten o valor: <small><code>2016-06-30T00:00Z</code></small> a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/dataset/modified/begin/2016-04-18T00:00Z/end/2016-06-30T00:00Z?_sort=title&_pageSize=10&_page=0</code></small></td></tr></tbody></table></div><br><div class="table-responsive"><table class="table table-condensed table-bordered"><caption><strong>Distribucións</strong></caption><thead><tr><th>Operación</th><th>Descrición</th><th>Exemplos</th></tr></thead><tbody><tr><td><strong>Obter todas as distribucións</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/distribution</strong></code></small></td><td></td></tr><tr><td><strong>Obter as distribucións dun conxunto de datos identificado polo seu identificador URI</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/distribution/dataset/{id}</strong></code></small><br><br>Débese especificar o valor de <small class="text-error"><code><strong>{id}</strong></code></small>.</td><td>Se <small><code>{id}</code></small> ten o valor: <small><code>'a16003011-empresas-y-personas-empleadas-en-la-c-a-de-euskadi-supervivientes-en-2015-altas-en-los-cinco-anos-anteriores-por-territorio-y-comarca-de-sede-social'</code></small>, a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/distribution/dataset/a16003011-empresas-y-personas-empleadas-en-la-c-a-de-euskadi-supervivientes-en-2015-altas-en-los-cinco-anos-anteriores-por-territorio-y-comarca-de-sede-social</code></small></td></tr><tr><td><strong>Obter as distribucións que están nun determinado formato</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/distribution/format/{format}</strong></code></small></td><td>Se <small><code>{format}</code></small> ten o valor: <small><code>'csv'</code></small>, a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/catalog/distribution/format/csv</code></small></td></tr></tbody></table></div><br><div class="table-responsive"><table class="table table-condensed table-bordered"><caption><strong>Publicadores</strong></caption><thead><tr><th>Operación</th><th>Descrición</th><th>Exemplos</th></tr></thead><tbody><tr><td><strong>Obter todos os publicadores</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/publisher</strong></code></small></td><td></td></tr></tbody></table></div><br><div class="table-responsive"><table class="table table-condensed table-bordered"><caption><strong>Ámbitos xeográficos</strong></caption><thead><tr><th>Operación</th><th>Descrición</th><th>Exemplos</th></tr></thead><tbody><tr><td><strong>Obter todas opcións de cobertura xeográfica con conxuntos de datos no catálogo</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/spatial</strong></code></small></td><td></td></tr></tbody></table></div><br><div class="table-responsive"><table class="table table-condensed table-bordered"><caption><strong>Categorías / Temáticas</strong></caption><thead><tr><th>Operación</th><th>Descrición</th><th>Exemplos</th></tr></thead><tbody><tr><td><strong>Obter todas as categorías ou temáticas con conxuntos de datos no catálogo</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/catalog/theme</strong></code></small></td><td></td></tr></tbody></table></div><br><h3>Norma técnica de interoperabilidade</h3><p>Conxunto de chamadas que permiten consultar o contido da <strong>taxonomía de sectores primarios</strong> e a <strong>identificación de cobertura xeográfica</strong> definidas nos Anexos IV e V da <a href="https://www.boe.es/diario_boe/txt.php?id=BOE-A-2013-2380" target="_blank">Norma Técnica de Interoperabilidade de Reutilización de recursos da información</a> <strong>(NTI)</strong>.</p><div class="table-responsive"><table class="table table-condensed table-bordered"><caption><strong>Taxonomía de sectores primarios</strong></caption><thead><tr><th>Operación</th><th>Descrición</th><th>Exemplos</th></tr></thead><tbody><tr><td><strong>Obter todos os sectores primarios</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/nti/public-sector</strong></code></small></td><td></td></tr><tr><td><strong>Obter un determinado sector polo seu identificador URI</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/nti/public-sector/{id}</strong></code></small><br><br>Débese especificar o valor de <small class="text-error"><code><strong>{id}</strong></code></small>.</td><td>Por exemplo, se o <small><code>{id}</code></small> ten o valor: <small><code>'comercio'</code></small>, a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/nti/public-sector/comercio</code></small></td></tr></tbody></table></div><br><div class="table-responsive"><table class="table table-condensed table-bordered"><caption><strong>Identificación de cobertura xeográfica</strong></caption><thead><tr><th>Operación</th><th>Descrición</th><th>Exemplos</th></tr></thead><tbody><tr><td><strong>Obter todas as provincias</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/nti/territory/Province</strong></code></small></td><td></td></tr><tr><td><strong>Obter unha determinada provincia identificada polo seu identificador URI</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/nti/territory/Province/{id}</strong></code></small><br><br>Débese especificar o valor de <small class="text-error"><code><strong>{id}</strong></code></small></td><td>Por exemplo, se o <small><code>{id}</code></small> ten o valor: <small><code>'Madrid'</code></small>, a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/nti/territory/Province/Madrid</code></small>.</td></tr><tr><td><strong>Obter todas as Comunidades Autónomas</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/nti/territory/Autonomous-region</strong></code></small></td><td></td></tr><tr><td><strong>Obter unha determinada comunidade autonomía identificada polo seu identificador URI</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/nti/territory/Autonomous-region/{id}</strong></code></small><br><br>Débese especificar o valor de <small class="text-error"><code><strong>{id}</strong></code></small>.</td><td>Por exemplo, se o <small><code>{id}</code></small> ten o valor: <small><code>'Comunidad-Madrid'</code></small>, a chamada será: <br><br><small class="text-error"><code>http://datos.gob.es/apidata/nti/territory/Autonomous-region/Comunidad-Madrid</code></small></td></tr><tr><td><strong>Obter o país</strong></td><td><small class="text-error"><code><strong>http://datos.gob.es/apidata/nti/territory/Country/España</strong></code></small></td><td></td></tr></tbody></table></div>
