Repository: datosgobes/ckanext-dge
Catalog: ckanext/dge/i18n/*/LC_MESSAGES/ckanext-dge.po
Languages: gl

source: API Data
gl: API

source: API_introduction %(page)s %(doc)s
gl: <p>O API é un mecanismo que permite consultar a base de datos semántica de datos.gob.es. Actualmente proporciona acceso ao <a href="https://datos.gob.es/catalogo">Catálogo de datos</a> e ás URIs correspondentes á <strong>taxonomía de sectores primarios</strong> e á <strong>identificación de cobertura xeográfica</strong> definidas nos Anexos IV e V da <a href="https://www.boe.es/diario_boe/txt.php?id=BOE-A-2013-2380" target="_blank">Norma Técnica de Interoperabilidade de Reutilización de recursos da información</a> <strong>(NTI)</strong>.</p><p>As consultas a través do API utilizan identificadores uniformes de recursos (URI) e constrúense sobre a base dunha serie de criterios que pode elixir o usuario.</p><p>Nesta páxina está dispoñible a documentación dos métodos, parámetros e modelo do API de forma interactiva e pódense realizar consultas de proba. Dispós de información sobre o API e exemplos de consultas na seguinte <a href='%(page)s'>páxina</a>.</p>

source: ATOM Data Catalog
gl: Catálogo de datos ATOM

source: About Aporta initiative
gl: Sobre a iniciativa Aporta

source: About us
gl: Sobre nós

source: Accessibility
gl: Accesibilidade

source: Access
gl: Acceder

source: Accessible version
gl: Versión accesible

source: Active
gl: Activo

source: Add new resource
gl: Engadir nova distribución

source: Additional Info
gl: Información adicional

source: Administration level
gl: Nivel de administración

source: Advise and support
gl: Asesoramento e soporte

source: Annual
gl: Anual

source: Api key
gl: Clave del api

source: Aporta Meetings
gl: Encontros Aporta

source: Aporta awards
gl: Premios Aporta

source: Challenges
gl: Desafíos

source: Aporta challenge
gl: Desafío Aporta

source: Aporta initiative
gl: Iniciativa Aporta

source: Applications
gl: Aplicacións

source: Back to job list
gl: Volver á lista de tarefas

source: Base url
gl: Url base

source: Biennial
gl: Bienal

source: Bimonthly
gl: Bimensual

source: Biweekly
gl: Quincenal

source: WEEKLY
gl: SEMANALMENTE

source: MONTHLY
gl: MENSUAL

source: CSV Data Catalog
gl: Catálogo de datos CSV

source: Catalog Errors/Warnings
gl: Erros/advertencias do catálogo

source: Category
gl: Categoría

source: Comments
gl: Comentarios

source: What we do
gl: Que facemos

source: Metrics and impact
gl: Métricas e impacto

source: Presencia en RRSS EN
gl: Presencia en RRSS GL

source: Frequently Asked Questions
gl: Preguntas frecuentes

source: FAQs
gl: Preguntas frecuentes

source: Technology
gl: Tecnoloxía

source: Contact
gl: Contacto

source: Contacta con nosotros EN
gl: Contacta connosco

source: Información de interés EN
gl: Información de interese

source: Site map
gl: Mapa do sitio

source: Contact and more information
gl: Contacto e máis información

source: Continuous
gl: Continuo

source: Cookies policiy
gl: Política de cookies

source: Create Dataset
gl: Crear conxunto de datos

source: Create a new user account
gl: Crear unha nova conta de usuario

source: Create new account
gl: Crear nova conta

source: Created
gl: Creado

source: Culture
gl: Cultura

source: Culture and Leisure
gl: Cultura e lecer

source: Current news
gl: Actualidade

source: Data
gl: Datos

source: Open data catalogue
gl: Catálogo de datos abertos

source: Data request
gl: Solicitude de datos

source: Support for publishers
gl: Apoio a publicadores

source: Safe environments
gl: Interfaces seguras

source: Data spaces
gl: Espazos de datos

source: Community
gl: Comunidade

source: Knowledge
gl: Coñecemento

source: Data exercises
gl: Exercicios de datos

source: Infographics
gl: Infografías

source: Reports and guides
gl: Informes e guías

source: Aporta meetings
gl: Encontros Achega

source: Daily
gl: Diario

source: Data Catalog
gl: Catálogo de datos

source: Data requests
gl: Dispoñibilidade de datos

source: Datasets Errors/Warnings
gl: Erros/advertencias dos conxuntos de datos

source: Datos.gob.es. Reuse the public information . Go home
gl: Datos.gob.es reutiliza a información pública. Ir a inicio

source: First Vice Presidency of the Government
gl: Vicepresidencia Primeira do Goberno

source: Open data from the Spanish government for the opening of public information and the development of advanced data-driven services. It is promoted by the Ministry for Digital Transformation and Public Service and the Public Business Entity Red.es.
gl: Datos abertos do Goberno de España para a apertura da información pública y desenvolvemento de servizos avanzados baseados en datos. Está promovido polo Ministerio de Transformación Dixital e Función Pública e a Entidade Pública Empresarial Red.es.

source: Delete all harvest jobs and existing datasets from this source
gl: Eliminar todas as tarefas de recolección e as bases de datos existentes desta fonte

source: Delete datasets
gl: Eliminar datasets

source: Deleted
gl: Eliminado

source: Description
gl: Descrición

source: Details
gl: Detalles

source: Documentation
gl: Documentación

source: Download
gl: Descargar

source: Download search results in CSV format
gl: Descargar resultados dá busca en formato CSV

source: Draft
gl: Borrador

source: Datos.gob.es wants to encourage the participation of users through comments that contribute to enriching the content published on the website. The comments received will be reviewed and approved by the portal management team to ensure quality. It reserves the right to remove comments that it deems inappropriate. Therefore, comments that include insults, disqualifications or considerations unrelated to the content in question will not be published. Comments that include personal data or that allow the identification of deceased people will not be published.
gl: Datos.gob.es quere favorecer a participación dos usuarios a través de comentarios que contribúan a enriquecer os contidos publicados na web. Os comentarios recibidos serán revisados e aprobados polo equipo xestor do portal para garantir a calidade. Reserva para si o dereito de elimina-los comentarios que considere inadecuados. Non se publicarán, por tanto, comentarios que inclúan insultos, descaalificacións ou consideracións non relacionadas co contido en cuestión. Tampouco se publicarán comentarios que inclúan datos persoais ou que permitan identificar persoas falecidas.

source: Edit resource
gl: Editar a distribución

source: Education
gl: Educación

source: Transport
gl: Transporte

source: Health and Wellness
gl: Saúde e benestar

source: Tourism
gl: Turismo

source: Justice and society
gl: Xustiza e sociedade

source: Enter the terms you wish to search for.
gl: Ingrese os termos que desexa procurar.

source: Environment
gl: Medio ambiente

source: Error Report
gl: Informe de erros

source: Error/Warning Summary
gl: Resumo de erros/advertencias

source: Events
gl: Eventos

source: Every
gl: Cada

source: seconds
gl: segundos

source: minutes
gl: minutos

source: hours
gl: horas

source: days
gl: días

source: months
gl: meses

source: weeks
gl: semanas

source: years
gl: anos

source: Every {time_value} {time_unit}
gl: Cada {time_value} {time_unit}

source: High-Value Dataset
gl: Conxuntos de datos de alto valor

source: High-Value Dataservice
gl: Servizos de datos de alto valor

source: Explore
gl: Explorar

source: Export metadata in CSV format
gl: Exportar metadatos en formato CSV

source: Export metadata in JSON format
gl: Exportar metadatos en formato JSON

source: Export metadata in RDF format
gl: Exportar metadatos en formato RDF

source: Export metadata in TURTLE format
gl: Exportar metadatos en formato TURTLE

source: Export metadata in XML format
gl: Exportar metadatos en formato XML

source: Farming
gl: Agricultura

source: Filter Results
gl: Filtrar resultados

source: Request dataset
gl: Solicitar conxunto de datos

source: Share this content
gl: Comparte este contido

source: Entity
gl: Entidade

source: Discover the content to carry out the digital transformation of your business.
gl: Descobre conxuntos de datos abertos polas organizacións e dispostos para a súa reutilización

source: Harvest description.
gl: Esta pantalla permite xestionar a federación de conxuntos de datos no portal, facilitando a integración e actualización dos datos das distintas organizacións, garantindo a súa correcta publicación e acceso.

source: Follow Us
gl: Síganos

source: Follow us on Flickr
gl: Síguenos en Flickr

source: Follow us on LinkedIn
gl: Síguenos en LinkedIn

source: Follow us on SlideShare
gl: Síguenos en SlideShare

source: Follow us on X
gl: Síguenos en X

source: Follow us on YouTube
gl: Síguenos en YouTube

source: Follow us on Instagram
gl: Síguenos en Instagram

source: Follow us on GitHub
gl: Síguenos en GitHub

source: Access to European Data Portal (Spanish catalogs)
gl: Acceso ao Portal Europeo de Datos (catálogos españois)

source: Format
gl: Formato

source: From
gl: De

source: Go
gl: Ir

source: Go to Government of Spain
gl: Ir ao Goberno de España

source: Go to Ministry of Territorial Government and Public Administrations
gl: Ir ao Ministerio de Política Territorial e Función Pública

source: Go to Red point es
gl: Vai ao Red punto es

source: Go to resource
gl: Ir distribución

source: Harvest
gl: Federador

source: Harvester
gl: Recolección

source: Home
gl: Comezar

source: Impact
gl: Impacto

source: Index of contents
gl: Índice de contidos

source: Informing about
gl: Informa sobre

source: Initiatives
gl: Iniciativas

source: Initiatives map
gl: Mapa de iniciativas

source: Innovation
gl: Innovación

source: Interact
gl: Interactúe

source: Interviews
gl: Entrevistas

source: Delete the federation tasks and related datasets
gl: Eliminar as tarefas de federación e os conxuntos de datos vinculados con estas

source: Languages
gl: Idioma

source: Last Harvest Job
gl: Última tarefa de recolección

source: Last Modified
gl: Última modificación

source: Legal Administration
gl: Administración de Xustiza

source: Legal notice
gl: Aviso legal

source: License
gl: Licenza

source: Local Administration
gl: Administración Local

source: Log in
gl: Iniciar sesión

source: Log out
gl: Pechar sesión

source: Manage
gl: Administrar

source: Media
gl: Arquivos

source: Menu
gl: Menú

source: Modified Ascending
gl: Modificado ascendente

source: Modified Descending
gl: Modificado descendente

source: Monthly
gl: Mensual

source: My Account
gl: A miña conta

source: My Datasets
gl: Conxuntos de datos

source: My Profile
gl: O meu perfil

source: Navigation
gl: Navegación

source: New resource
gl: Nova distribución

source: News
gl: Novas

source: Newsletter
gl: Boletín

source: Newsletter personal data consent
gl: Consinto que Red.es, con C.I.F. Q-2891006-E, como responsable do tratamento, procese os datos proporcionados directamente por min, así como os obtidos indirectamente a partir da miña actividade, de acordo á Política de privacidade e á instrución do director xeral sobre o procedemento para o exercicio dos dereitos á protección de datos de carácter persoal, dispoñibles na seguinte ligazón: <a href="http://www.red.es/redes/gl/quienes-somos/protecci%%C3%%B3n-de-datos-de-car%%C3%%A1cter-personal" target="_blank">Protección de datos de carácter persoal</a>.

source: No License Provided
gl: Non se proporcionou licenza

source: No errors for this job
gl: Non hai erros para esta tarefa

source: No jobs yet for this source
gl: Non hai tarefas aínda para esta fonte

source: No organization
gl: Ningunha organización

source: No está autorizado para acceder al recurso solicitado
gl: Non está autorizado para acceder ao recurso solicitado

source: Not yet
gl: Aínda non

source: Only the 20 most frequent errors/warnings are shown
gl: Só se mostran os 20 erros/advertencias máis frecuentes

source: Opens a new window
gl: Abre en ventá nova

source: Order by
gl: Ordenar por resultados

source: Other
gl: Outro

source: Other Institutions
gl: Outras institucións

source: Password
gl: Contrasinal

source: Portal content
gl: Contido do portal

source: Private
gl: Privada

source: Private Entity
gl: Entidade Privada

source: Public
gl: Pública

source: Published Ascending
gl: Publicado ascendente

source: Published Descending
gl: Publicado descendente

source: Publisher
gl: Publicador

source: Quarterly
gl: Trimestral

source: RDF Data Catalog
gl: Catálogo de datos RDF

source: Regional Administration
gl: Administración Autonómica

source: Remove
gl: Quitar

source: Request new password
gl: ¿Olvidaches o contrasinal?

source: Request new password via e-mail
gl: Solicitar un novo contrasinal por correo electrónico

source: Resources
gl: Distribucións

source: Companies
gl: Empresas

source: Reuse companies
gl: Reutilizar empresas

source: Save
gl: Gardar

source: Search
gl: Buscar

source: Search datasets...
gl: Procurar nas bases de datos...

source: Search form
gl: Formulario de procura

source: Search harvest sources...
gl: Procurar fontes de recolección...

source: Search organizations...
gl: Procurar organizacións...

source: Sectors
gl: Sectores

source: See Aporta Initiative
gl: Vao á iniciativa Aporta

source: Semiannual
gl: Semestral

source: Semimonthly
gl: Bimensual

source: Semiweekly
gl: Bisemanal

source: Share
gl: Compartir

source: Share this on LinkedIn
gl: Comparte isto en LinkedIn

source: Share this on X
gl: Comparte isto en X

source: Show More {facet_type}
gl: Mostrar máis

source: Show Only Popular {facet_type}
gl: Mostrar só populares

source: Sitemap
gl: Mapa do sitio

source: Source name
gl: Nome

source: Source organization
gl: Organización

source: Source type
gl: Tipo de federador

source: Sparql Point
gl: Punto SPARQL

source: Sparql_Point_introduction %(page)s %(doc)s
gl: <p>A través deste formulario, poderás configurar as túas propias consultas en <a href="https://www.w3.org/TR/rdf-sparql-query/" target="_blank">linguaxe SPARQL</a> sobre os grafos RDF de datos.gob.es. Esta é a opción máis flexible e potente para realizar consultas sobre o Catálogo de datos.</p><p>A base de datos semántica de datos.gob.es contén dous grafos:</p><ul class="custom-bullets"><li><strong>http://datos.gob.es/catalogo:</strong> este grafo contén todo o <a href="https://datos.gob.es/es/catalogo">Catálogo de datos</a> de datos.gob.es</li><li><strong>http://datos.gob.es/nti:</strong> contén as URIs correspondentes á <strong>taxonomía de sectores primarios</strong> e á <strong>identificación de cobertura xeográfica</strong> definidas nos Anexos IV e V da <a href="https://www.boe.es/diario_boe/txt.php?id=BOE-A-2013-2380" target="_blank">Norma Técnica de Interoperabilidade de Reutilización de recursos da información</a> <strong>(NTI)</strong></li></ul><p>Os resultados das consultas pódense obter en distintos formatos procesables automaticamente (csv, xml, rdf, json...) e ser reutilizados directamente.</p><p>Tes máis información dispoñible e exemplos de consultas na seguinte <a href='%(page)s'>páxina</a>.</p>

source: Start a new harvesting job for this harvest source now
gl: Iniciar agora unha nova tarefa de recolección para esta fonte

source: Started
gl: Empezado

source: State
gl: Estado

source: State Administration
gl: Administración do Estado

source: Status
gl: Estado

source: Subscribe
gl: Subscríbete

source: Unsubscribe
gl: Cancelar subscrición

source: Tag
gl: Etiqueta

source: There already is an unrun job for this source
gl: Xa existe unha tarefa sen executar para esta fonte

source: There are currently no organizations for this site
gl: Actualmente non hai organizacións para este sitio

source: There are no {facet_type} that match this search
gl: Non hai {facet_type} que coincidan coa procura

source: There is no description for this harvest source
gl: Non hai descrición para esta fonte de recolección

source: This can be edited only by the admin
gl: Este campo só pode ser editado por un usuario administrador

source: This dataset has no data
gl: Este conxunto de datos non ten datos

source: This {package_type} has no description
gl: Este {package_type} non ten ningunha descrición

source: dataservice
gl: servizo de datos

source: dataset
gl: conxunto de datos

source: This dataset satisfies the Open Definition.
gl: Este conxunto de datos satisfai a definición de código aberto.

source: This field is required
gl: Este campo é requirido

source: Three times a month
gl: Tres veces por mes

source: Three times a week
gl: Tres veces por semana

source: Three times a year
gl: Cuadrimestral

source: To
gl: Para

source: Triennial
gl: Trienal

source: Twice a day
gl: Dúas veces por día

source: Unassigned data requests
gl: Datos non asignados

source: Universities
gl: Universidades

source: Unnamed resource
gl: Distribución sen nome

source: Update frequency
gl: Frecuencia de actualización

source: Used prefixes
gl: Prefixos usados

source: User %s not authorized to show harvest source %s
gl: Usuario %s non autorizado para mostrar as fontes de recolección de datos %s

source: Username
gl: Nome de usuario

source: Users Management
gl: Xestión de usuarios

source: Weekly
gl: Semanal
