Repository: datosgobes/ckanext-dge
Catalog: ckanext/dge/i18n/*/LC_MESSAGES/ckanext-dge.po
Languages: gl

source: accessible_sparql_content
gl: <p>A interface SPARQL é un servizo que permite realizar consultas sobre datos almacenados en RDF mediante a <a href="https://www.w3.org/TR/rdf-sparql-query/" target="_blank">linguaxe SPARQL</a>. Ofrécelles aos desenvolvedores/profesionais unha gran potencia e flexibilidade á hora de realizar consultas e construír aplicacións.</p><h2>Información almacenada</h2><p>Toda a información que se pode consultar atópase cargada nunha base de datos semántica. Neste tipo de bases de datos a información almacénase en grafos.</p><p>A base de datos semántica de datos.gob.es conta con dous grafos:</p><ul class="custom-bullets"><li><strong>http://datos.gob.es/catalogo:</strong> este grafo contén todo o <strong><a href="http://datos.gob.es/gl/catalogo">Catálogo de datos</a></strong> de datos.gob.es</li><li><strong>http://datos.gob.es/nti:</strong> contén as URIs correspondentes á <strong>taxonomía de sectores primarios</strong> e á <strong>identificación de cobertura xeográfica</strong> definidas nos Anexos IV e V da <a href="https://www.boe.es/diario_boe/txt.php?id=BOE-A-2013-2380" target="_blank">Norma Técnica de Interoperabilidade de Reutilización de recursos da información</a> <strong>(NTI)</strong></li></ul><h2>Como se usa</h2><p>As consultas fanse a través de peticións GET, que devolven os datos segundo os parámetros que se especifican na chamada.</p><p>O enderezo base do noso punto de SPARQL é o seguinte:</p><p class="alert alert-info"><small class="text-error"><code><strong>http://datos.gob.es/virtuoso/sparql</strong></code></small></p><p>A este enderezo haille que engadir o parámetro “query” e a continuación a consulta que queremos realizar.</p><p>Por exemplo, se queremos executar a seguinte consulta, <code>select distinct ?type where {?x a ?type} LIMIT 100</code>, que obteñen os diferentes tipos que hai cargados no noso punto de SPARQL:</p><ol><li>Debemos codificala substituíndo os espazos por “+” da seguinte forma: <code>select+distinct+?type+where+{?x+a+?type}+LIMIT+100</code></li><li>Unha vez codificada e coñecendo o enderezo do noso punto de SPARQL, executaríase do seguinte xeito:<br /><br /><span class="alert alert-info"><small class="text-error"><code><strong>http://datos.gob.es/virtuoso/sparql?query=select+distinct+?type+where+{?x+a+?type}+LIMIT+100</strong></code></small></span></li></ol><p>Se ao enderezo base do punto SPARQL, non lle engadimos o parámetro query coa consulta que queremos realizar, devolveranos un erro de páxina non encontrada.</p><p>O formato por defecto das respostas é HTML, pero pódese especificar outro a través do parámetro “format”. Este parámetro pode tomar os seguintes valores:</p><div class="table-responsive"><table class="table table-condensed table-bordered"><thead><tr><th>Valor</th><th>Formato</th></tr></thead><tbody><tr><td>text/html</td><td>HTML</td></tr><tr><td>application/vnd.ms-excel</td><td>Spreadsheet</td></tr><tr><td>text/tab-separated-values</td><td>TSV</td></tr><tr><td>application/sparql-results+xml</td><td>XML</td></tr><tr><td>application/sparql-results+json</td><td>JSON</td></tr><tr><td>application/javascript</td><td>Javascript</td></tr><tr><td>text/turtle</td><td>Turtle</td></tr><tr><td>application/rdf+xml</td><td>RDF/XML</td></tr><tr><td>text/plain</td><td>N-Triples</td></tr><tr><td>text/csv</td><td>CSV</td></tr></tbody></table></div><p>Se ao realizar a consulta non se especifica ningún grafo, devolverase a información de todos os grafos que estean dispoñibles.</p><p>Pódense consultar os grafos dispoñibles con esta consulta:</p><p class="alert alert-info"><small class="text-error"><code><strong>select distinct ?uri where { graph ?uri { ?s a ?t } }</strong></code></small></p><p>Se queremos obter a que grafo pertence a información, pódese especificar do seguinte xeito onde a variable ?g imos ver en que grafo se encontra cada ?x.</p><p class="alert alert-info"><small class="text-error"><code><strong>select distinct ?g ?type where { graph ?g { ?x a ?type. } } limit 100</strong></code></small></p><p>Podemos obter os resultados de un só do seguinte xeito:</p><p class="alert alert-info"><small class="text-error"><code><strong>select distinct ?type where { graph &lthttp://datos.gob.es/catalogo&gt { ?x a ?type. } } limit 100</strong></code></small></p><p>Agora só veremos as ?x que se encontren no grafo especificado</p><p>Para realizar as peticións tamén se pode utilizar un <a href="http://datos.gob.es/gl/sparql">formulario</a>. Este tipo de formularios ofrecen axuda ao desenvolvedor proporcionando unha área de texto que usa cores para resaltar a sintaxe, identifica erros de sintaxe, ten función autocompletado e permite a opción de executar as consultas, entre outros.</p><h2>Exemplos</h2><h3>Obter todas as clases que hai no noso punto de SPARQL</h3><p>Esta consulta é moi útil porque imos ver todos os tipos de información que hai almacenados.</p><p>Ademais para evitar obter información que non nos axuda, imos especificar os nosos grafos.</p><p>Primeiro especificamos o grafo do Catálogo:</p><p class="alert alert-info"><small class="text-error"><code><strong>select distinct ?tipo where <br/>{ <br/>graph &lt;http://datos.gob.es/catalogo&gt; {<br/> ?x a ?tipo.<br/>} <br/>}</strong></code></small></p><p>Agora usaremos os dous grafos á vez grazas a <strong>VALUES</strong></p><p class="alert alert-info"><small class="text-error"><code><strong>select distinct ?tipo where <br/>{ <br/>graph ?grafo { <br/>?x a ?tipo.<br/>}<br/> values ?grafo { &lt;http://datos.gob.es/catalogo&gt; &lt;http://datos.gob.es/nti&gt; } <br/>}</strong></code></small></p><p>O resultado final é este:</p><div class="table-responsive"><table class="table table-condensed table-bordered"><thead><tr><th>tipo</th></tr></thead><tbody><tr><td>http://www.w3.org/ns/dcat#Dataset</td></tr><tr><td>http://www.w3.org/2004/02/skos/core#Concept</td></tr><tr><td>http://www.w3.org/ns/dcat#Catalog</td></tr><tr><td>http://www.w3.org/2006/time#DurationDescription</td></tr><tr><td>http://purl.org/dc/terms/Frequency</td></tr><tr><td>http://purl.org/dc/terms/IMT</td></tr><tr><td>http://purl.org/dc/terms/PeriodOfTime</td></tr><tr><td>http://www.w3.org/ns/dcat#Distribution</td></tr><tr><td>http://vocab.linkeddata.es/datosabiertos/def/sector-publico/territorio#ComunidadAutonoma</td></tr><tr><td>http://vocab.linkeddata.es/datosabiertos/def/sector-publico/territorio#CiudadAutonoma</td></tr><tr><td>http://vocab.linkeddata.es/datosabiertos/def/sector-publico/territorio#Pais</td></tr><tr><td>http://vocab.linkeddata.es/datosabiertos/def/sector-publico/territorio#Provincia</td></tr></tbody></table></div><h3>Obter todos os conxuntos de datos do Catálogo</h3><p>Agora que xa coñecemos os tipos, imos pedir todos os conxuntos de datos, que se corresponden con esta http://www.w3.org/ns/dcat#Dataset</p><p class="alert alert-info"><small class="text-error"><code><strong>select distinct ?dataset where<br/> {<br/> ?dataset a &lt;http://www.w3.org/ns/dcat#Dataset&gt; <br/>}</strong></code></small></p><p>O resultado é unha lista de URLs de todos os datasets.</p><h3>Obter todas as propiedades que teñen os conxuntos de datos</h3><p>Queremos obter máis información dos conxuntos de datos, pero só sabemos os seus URIs, imos preguntar por todas as súas propiedades:</p><p class="alert alert-info"><small class="text-error"><code><strong>select distinct ?propiedad where<br/> {<br/> ?dataset a &lt;http://www.w3.org/ns/dcat#Dataset&gt; . ?dataset ?propiedad ?valor . <br/>}</strong></code></small></p><p>Estas son todas as propiedades que teñen:</p><div class="table-responsive"><table class="table table-condensed table-bordered"><thead><tr><th>propiedade</th></tr></thead><tbody><tr><td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td></tr><tr><td>http://purl.org/dc/terms/modified</td></tr><tr><td>http://www.w3.org/ns/dcat#distribution</td></tr><tr><td>http://www.w3.org/ns/dcat#keyword</td></tr><tr><td>http://www.w3.org/ns/dcat#theme</td></tr><tr><td>http://purl.org/dc/terms/accrualPeriodicity</td></tr><tr><td>http://purl.org/dc/terms/description</td></tr><tr><td>http://purl.org/dc/terms/identifier</td></tr><tr><td>http://purl.org/dc/terms/issued</td></tr><tr><td>http://purl.org/dc/terms/language</td></tr><tr><td>http://purl.org/dc/terms/publisher</td></tr><tr><td>http://purl.org/dc/terms/spatial</td></tr><tr><td>http://purl.org/dc/terms/title</td></tr><tr><td>http://purl.org/dc/terms/references</td></tr><tr><td>http://purl.org/dc/terms/temporal</td></tr><tr><td>http://purl.org/dc/terms/conformsTo</td></tr><tr><td>http://purl.org/dc/terms/valid</td></tr></tbody></table></div><h3>Obter todos os organismos que publican datos</h3><p>Imos utilizar a propiedade <a href="https://datos.gob.es.evo/http://purl.org/dc/terms/publisher">http://purl.org/dc/terms/publisher</a> para obter todos os organismos que publican datos.</p><p class="alert alert-info"><small class="text-error"><code><strong>select distinct ?publicador where<br/> {<br/> ?x a &lt;http://www.w3.org/ns/dcat#Dataset&gt; .<br/> ?x &lt;http://purl.org/dc/terms/publisher&gt; ?publicador. <br/>}</strong></code></small></p><p>O resultado é o conxunto das URIs de todos os publicadores</p><div class="table-responsive"><table class="table table-condensed table-bordered"><thead><tr><th>publicador</th></tr></thead><tbody><tr><td>http://datos.gob.es/recurso/sector-publico/org/Organismo/A02002834</td></tr><tr><td>http://datos.gob.es/recurso/sector-publico/org/Organismo/A04003003</td></tr><tr><td>http://datos.gob.es/recurso/sector-publico/org/Organismo/A05003638</td></tr><tr><td>…</td></tr></tbody></table></div><h3>Obter as propiedades dos organismos que publican datos</h3><p>Coas URIs non sabemos o nome dos organismos, imos preguntar polas propiedades destas URIs</p><p class="alert alert-info"><small class="text-error"><code><strong>select distinct ?propiedad where<br/> {<br/> ?x a &lt;http://www.w3.org/ns/dcat#Dataset&gt; . <br/>?x &lt;http://purl.org/dc/terms/publisher&gt; ?publicador. <br/>?publicador ?propiedad ?valor. <br/>} </strong></code></small></p><p>Estas son todas as propiedades dos publicadores:</p><div class="table-responsive"><table class="table table-condensed table-bordered"><thead><tr><th>propiedade</th></tr></thead><tbody><tr><td>http://www.w3.org/1999/02/22-rdf-syntax-ns#type</td></tr><tr><td>http://www.w3.org/2004/02/skos/core#prefLabel</td></tr><tr><td>http://www.w3.org/2004/02/skos/core#notation</td></tr></tbody></table></div><h3>Obter os nomes dos organismos que publican datos</h3><p>Imos pedir a URI e a propiedade http://www.w3.org/2004/02/skos/core#prefLabel</p><p class="alert alert-info"><small class="text-error"><code><strong>select distinct ?publicador ?label where<br/> { <br/>?x a &lt;http://www.w3.org/ns/dcat#Dataset&gt; . <br/>?x &lt;http://purl.org/dc/terms/publisher&gt; <br/>?publicador. ?publicador &lt;http://www.w3.org/2004/02/skos/core#prefLabel&gt; ?label. <br/>}</strong></code></small></p><p>O resultado é unha lista moi longa:</p><div class="table-responsive"><table class="table table-condensed table-bordered"><thead><tr><th>publicador</th><th>label</th></tr></thead><tbody><tr><td>http://datos.gob.es/recurso/sector-publico/org/Organismo/A02002834</td><td>"Gobierno de Aragón"</td></tr><tr></tr><tr><td>http://datos.gob.es/recurso/sector-publico/org/Organismo/A04003003</td><td>"Gobierno de las Islas Baleares"</td></tr><tr></tr><tr><td>http://datos.gob.es/recurso/sector-publico/org/Organismo/A05003638</td><td>"Comunidad Autónoma de Canarias"</td></tr><tr></tr><tr><td>http://datos.gob.es/recurso/sector-publico/org/Organismo/A07002862</td><td>"Junta de Castilla y León"</td></tr><tr></tr><tr><td>…</td><td>…</td></tr><tr></tr></tbody></table></div><h3>Obter os nomes dos dez organismos que máis conxuntos de datos teñen publicados e visualizar o número destes</h3><p>Para realizar esta consulta imos ter que agrupar resultados, ordenalos e limitar o total a 10.</p><p class="alert alert-info"><small class="text-error"><code><strong>select distinct ?label count(?x) as ?num { <br/>?x a &lt;http://www.w3.org/ns/dcat#Dataset&gt; . <br/>?x &lt;http://purl.org/dc/terms/publisher&gt; ?publicador. <br/>?publicador &lt;http://www.w3.org/2004/02/skos/core#prefLabel&gt; ?label. <br/>} <br/>group by (?label) <br/>order by desc(?num) <br/>limit 10</strong></code></small></p><p>O resultado é este:</p><div class="table-responsive"><table class="table table-condensed table-bordered"><thead><tr><th>label</th><th>num</th></tr></thead><tbody><tr><td>"Gobierno de Aragón"</td><td>2659</td></tr><tr><td>"Comunidad Autónoma de País Vasco"</td><td>2208</td></tr><tr><td>"Centro de Investigaciones Sociológicas"</td><td>2107</td></tr><tr><td>"Ayuntamiento de Málaga"</td><td>651</td></tr><tr><td>"Ayuntamiento de Gijón"</td><td>627</td></tr><tr><td>"Xunta de Galicia"</td><td>315</td></tr><tr><td>"Generalitat Valenciana"</td><td>313</td></tr><tr><td>"Ayuntamiento de Madrid"</td><td>231</td></tr><tr><td>"Instituto Nacional de Estadística"</td><td>205</td></tr><tr><td>"Junta de Castilla y León"</td><td>196</td></tr></tbody></table></div>

source: close
gl: pechar

source: datasets with errors/warnings
gl: Conxuntos de datos con erros/advertencias

source: errors/warnings
gl: erros/advertencias

source: https://www.red.es/redes/es/quienes-somos/proteccion-de-datos-de-caracter-personal
gl: https://www.red.es/redes/es/quienes-somos/protección-de-datos-de-carácter-personal

source: to
gl: para

source: {num} Dataset
gl: {num} conxunto de datos

source: Do you want to stay up to date with the data economy
gl: Queres estar ó día de novidades ligadas a datos?

source: Subscribe to our newsletter to receive the latest news from datos.gob
gl: Subscríbete ó noso boletín para recibir as últimas novas publicadas en datos.gob.es

source: Email subscription to the latest news of datos.gob.es.
gl: Subscrición por correo electrónico ás últimas novidades de datos.gob.es.

source: You can cancel your subscription by <a href='%(url_baja)s' title='unsubscribe from the data.gob.es bulletin'>clicking here</a>
gl: Podes cancelar a túa subscrición <a href='%(url_baja)s' title='cancelar a subscrición ao boletín data.gob.es.'>fai clic aquí</a>

source: Search type
gl: Tipo de busca

source: OR
gl: OU

source: AND
gl: E

source: Search configuration
gl: Axustes de busca

source: Download search result in CSV
gl: Descarga o resultado da busca en CSV

source: Confirmation of this will delete all federated datasets in federation tasks carried out. Do this if you wish to delete the federated datasets and federate the federation source again. Are you sure you want to delete this federation source and all federated datasets?
gl: A confirmación desta acción eliminará todos os conxuntos de datos federados nas tarefas de federación realizadas. Utilice esta acción se desexa eliminar os conxuntos de datos federados e desexa federar de novo a fonte de federación. Está seguro de que quere eliminar todos os conxuntos de datos federados?

source: NSIP access
gl: Acceso NSIP

source: Ministry for Digital Transformation and Public Service
gl: Ministerio de Transformación Dixital e Función Pública

source: Copy link
gl: Copiar ligazón

source: {number} dataservice found for "{query}"
gl: {number} servizo de datos atopado para "{query}"

source: No dataservices found for "{query}"
gl: Non se atoparon servizos de datos para "{query}"

source: {number} dataservice found
gl: {number} servizo de datos atopado

source: No dataservices found
gl: Non se atoparon servizos de datos

source: Dataservices
gl: Servizos de datos

source: Information
gl: Información

source: Quality
gl: Calidade

source: Technical sheet
gl: Ficha técnica

source: Served datasets
gl: Conxuntos de datos servidos

source: Distributions
gl: Distribucións

source: Coverage
gl: Cobertura

source: Type of dataset
gl: Tipo de conxunto de datos

source: Keywords
gl: Palabras clave

source: Regulation
gl: Regulación

source: Identification
gl: Identificación

source: Resolution
gl: Resolución

source: References
gl: Referencias

source: Versioning
gl: Versionado

source: Interoperability
gl: Interoperabilidade

source: Provenance
gl: Procedencia

source: Reusability
gl: Reutilizabilidade

source: Access services
gl: Servizos de acceso

source: Read more
gl: Ler máis

source: Add Dataservice
gl: Engade Servizo de datos

source: Yes
gl: Si

source: No
gl: Non

source: Filter by
gl: Filtrar por

source: Delete filters
gl: Borrar filtros

source: {number} dataservice found for '{query}'
gl: {number} servizo de datos atopado para "{query}"

source: No dataservice found for '{query}'
gl: Sentímolo, non se atoparon servizos de datos para '{query}'

source: {number} dataset found for "{query}"
gl: {number} conxunto de datos atopados para "{query}"

source: No datasets found for "{query}"
gl: Sentímolo, non se atoparon conxuntos de datos para "{query}"

source: Frequency
gl: Frecuencia

source: Organization
gl: Organización

source: Read less
gl: Ler menos

source: View less
gl: Ver menos

source: View more
gl: Ver máis

source: dge_rdf
gl: NTI RDF

source: dge_dcat_ap_es_rdf
gl: DCAT-AP_ES

source: Subscribe to the data catalog
gl: Subscribirse ao catálogo de datos

source: Subscription by e-mail to the latest news from datos.gob.es.
gl: Subscrición por correo electrónico ás últimas novidades de datos.gob.es.

source: Unsubscribe from the data.gob.es bulletin
gl: Darse de baixa do boletín data.gob.es

source: {number} dataset found
gl: Atopouse {number} conxunto de datos

source: Data catalogue
gl: Catálogo de datos

source: Check the API
gl: Comproba a API

source: Access the SPARQL Point
gl: Accede ao punto SPARQL

source: Taxonomy of primary sectors
gl: Taxonomía dos sectores primarios

source: Identification of public organizations
gl: Identificación dos organismos públicos

source: Identification of geographic coverage in Spain
gl: Identificación da cobertura xeográfica en España

source: Page not found
gl: Páxina non atopada

source: We're sorry, but the page you're looking for doesn't exist or is no longer available.
gl: Sentímolo, pero a páxina que buscas non existe ou xa non está dispoñible.

source: Back to top
gl: Volver ao comezo

source: active
gl: activo

source: Forbidden
gl: Permiso denegado
